#pragma once
//씬 내용 enum
enum class Scene
{
	TITLE = 1,
	LOAD = 2,
	GAME = 3,
	CLEAR = 4,
	GAMEOVER = 5,
	ALLCLEAR = 6,
};

//--------------------------------------------------------------------
// 총알 구조체 선언
//--------------------------------------------------------------------
struct st_BULLET
{
	int		iX;
	int		iY;
	int		iPower;				// 총알 힘
	bool	iVisible;			// 총알 활성화
};

//--------------------------------------------------------------------
// 아군 구조체 선언
//--------------------------------------------------------------------
struct st_PLAYER
{
	int iHP;					// 플레이어 HP

	int iX;						// 플레이어 좌표
	int iY;

	int iVisible;				// 플레이어 생존 여부.

};

//--------------------------------------------------------------------
// 몬스터 구조체 선언
//--------------------------------------------------------------------
struct st_MONSTER
{
	int iHP = 0;					// 몬스터 HP

	int iX = 0;						// 몬스터 좌표
	int iY = 0;

	bool iVisible = false;		// 몬스터 생존 여부.
};